Repository: Hiiri522OE/cinnamon-spices-applets
Catalog: password-generator@spencerlommel.com/files/password-generator@spencerlommel.com/po/*.po
Languages: fi

source: Generate Random Password
fi: Luo satunnainen salasana

source: Please enable at least one value in settings.
fi: Salli vähintään yksi elementti asetuksissa.

source: Copy
fi: Kopioi

source: Configurable Password Generator
fi: Salasanageneraattorin asetukset

source: Password Generator
fi: Salasanageneraattori

source: Password Settings
fi: Salasanan asetukset

source: characters
fi: merkit

source: Password Length
fi: Salasanan pituus

source: The password can be any length from 1 to 32 characters.
fi: Salasanan pituus on yhdestä (1) 32:een merkkiin.

source: Include Lowercase Letters
fi: Sisällytä pienet kirjaimet

source: Include Uppercase Letters
fi: Sisällytä isot kirjaimet

source: Include Numbers
fi: Sisällytä numerot

source: Include Symbols
fi: Sisällytä symbolit

source: Copy Settings
fi: Kopioi asetukset

source: Automatically Copy To Clipboard
fi: Kopioi leikepöydälle automaattisesti

source: When clicking the lock icon, instead of opening a window where the password can be copied it is instead automatically copied to your Clipboard.
fi: Kun klikkaat lukkokuvaketta, sen sijaan, että avaisit ikkunan, jossa on salasana voit kopioida sen automaattisesti leikepöydällesi.

source: Play sound on copy
fi: Soita ääni kopioinnin yhteydessä

source: Toggles whether or not a sound is played when the password is copied to the Clipboard
fi: Vaihda, kuuluuko ääni, kun salasana kopioidaan leikepöydälle

source: Select a sound to play when the password is copied
fi: Valitse ääni, joka soitetaan, kun salasana on kopioitu
